{
  "backend/main.mo": "Motoko backend actor handling authorization, user profiles, expense records, Presentbin imports, and timestamp‑sorted storage with access control.",
  "feature_evidence.json": "Feature evidence report listing authentication‑related features, affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of prewritten short summaries for all major frontend files including auth, expenses, utilities, and UI components.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables for light/dark themes and applying them to core elements.",
  "frontend/index.html": "Root HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app shell handling Internet Identity auth, loading states, error display, and conditional profile setup before rendering the dashboard.",
  "frontend/src/components/auth/AuthErrorBanner.tsx": "UI alert component for displaying authentication errors with optional dismiss button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow, showing inline errors, and clearing state on retries.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Dialog for first‑time profile setup that collects a user name and submits it through the profile API.",
  "frontend/src/components/expenses/ExpenseList.tsx": "Displays a table of expenses with loading and empty states, and supports deleting individual records via a confirmation dialog.",
  "frontend/src/components/expenses/ExpenseTotals.tsx": "Calculates and shows total expenses grouped by currency with a loading and empty state.",
  "frontend/src/components/expenses/ManualExpenseForm.tsx": "Provides a form for manually adding expenses, including amount, currency, category, notes, and date/time.",
  "frontend/src/components/import/PresentbinImportPanel.tsx": "Allows pasting or uploading Presentbin JSON data, parses it, previews transactions, and imports them via mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useExpenses.ts": "Defines hooks for fetching, adding, deleting, and importing expenses through the backend actor with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login/logout controls.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and saving the caller’s user profile using the backend actor with query invalidation.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and applies base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Implements the expense dashboard with tabs for today, day, month, and import views using fetched and filtered expenses.",
  "frontend/src/utils/dates.ts": "Provides date formatting and utilities for computing day/month ranges and filtering expenses by timestamp.",
  "frontend/src/utils/fingerprint.ts": "Generates a deterministic string fingerprint for transactions using a simple hash.",
  "frontend/src/utils/presentbinParser.ts": "Parses and validates Presentbin JSON transactions, converts dates, and adds fingerprints.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project state metadata describing features, issues, and architectural context."
}